[
  {
    "_id": {"$oid":"507f1f77bcf86cd799439011"},
    "name": "EventSourcing i CQRS jako alternatywa dla CRUD",
    "description": "Nowy projekt... oczywistym wyborem jest architektura systemu oparta na CRUD... a może by tak zastosować rozwiązanie, które jak bumerang powraca z przeszłości? Nie czekaj i daj się zabrać w podróż do alternatywnej rzeczywistości zdarzeń, w której poznasz inny (lepszy?) sposób zaprojektowania swojego systemu. Postaram się dowieść, że alternatywne nie znaczy gorsze.",
    "location": "L120",
    "timeStart": "17:00",
    "timeEnd": "17:25",
    "speakers":[
      {"$oid":"507f1f77bcf86cd799439015"}
    ]
  },
  {
    "_id": {"$oid":"507f1f77bcf86cd799439012"},
    "name": "WebGL - wprowadzenie w trzeci wymiar stron internetowych",
    "description": "W ciągu ostatnich kilku lat możliwości tworzenia grafiki 3D w przeglądarkach internetowych dramatycznie wzrosły. Dzisiaj przeciętnej klasy komputer (i większość urządzeń mobilnych) wyposażony w powszechnie dostępne narzędzia opensource'owe mają większe możliwości niż stacje graficzne sprzed kilkunastu lat. Po krótkim teoretycznym wstępie do programowania grafiki 3D przyjrzymy się możliwościom jakie dają nam najnowsze technologie oraz dostępne biblioteki.",
    "location": "L120",
    "timeStart": "17:30",
    "timeEnd": "17:55",
    "speakers": [{"$oid":"507f1f77bcf86cd799439013"}]
  },
  {
    "_id": {"$oid":"507f1f77bcf86cd799439013"},
    "name": "Wprowadzenie do Blockchain",
    "description": "Blockchain - buzzword świata fintech, a może technologia, która zmieni świat? Czy w blockchainie nikt nie wie, że jesteś lodówką i każdy może wgrać co tylko chce? Zaprezentowane zostaną podstawy działania na przykładzie przypisania i przesyłania żetonów.",
    "location": "L120",
    "timeStart": "18:00",
    "timeEnd": "18:25",
    "speakers": [{"$oid":"507f1f77bcf86cd799439017"}]
  },
  {
    "_id": {"$oid":"507f1f77bcf86cd799439014"},
    "name": "Przerwa kawowa",
    "description": "",
    "location": "",
    "timeStart": "18:30",
    "timeEnd": "19:00",
    "speakers": []
  },
  {
    "_id": {"$oid":"507f1f77bcf86cd799439015"},
    "name": "Token Authentication in ASP.NET Core (JWT)",
    "description": "Autentykacja poprzez token (JWT) staje się powoli standardem w nowoczesnych aplikacjach mobilnych oraz single page applications. Do jej zaimplementowania wystarczy zwykły serwer Web Api oraz JavaScript. Korzyści z zastosowania są znaczące: bezstanowość, łatwiejsza skalowalność oraz spójna identyfikacja. Podczas prezentacji zostanie przedstawiona implementacja JWT oraz autentykacja użytkowników na przykłądzie prostej aplikacji SPA z wykorzystaniem ASP.NET Core oraz Angular 2.",
    "location": "L120",
    "timeStart": "19:00",
    "timeEnd": "19:25",
    "speakers": [{"$oid": "507f1f77bcf86cd799439011"}, {"$oid": "507f1f77bcf86cd799439012"}]
  },
  {
    "_id": {"$oid":"507f1f77bcf86cd799439016"},
    "name": "Roboty stworzone z klocków LEGO",
    "description": "Prelekcja zostanie sprowadzona do czeterech głównych punktów: nauka, nauka poprzez zabawę, zabawa poprzez naukę i zabawa.",
    "location": "L120",
    "timeStart": "19:30",
    "timeEnd": "19:55",
    "speakers": [{"$oid": "507f1f77bcf86cd799439016"}]
  },
  {
    "_id": {"$oid":"507f1f77bcf86cd799439017"},
    "name": "A Docker Story - from Desktop to Production",
    "description": "Docker i Docker Compose. Co to jest? Co daje? Co znaczy \"zdokeryzowana\" aplikacja? Jakie są przypadki użycia Dockera i jakie problemy rozwiązuje? Odpowiem na te pytania pokazując Demo -> developerka na Dekstop, wdrożenie i testy na Stage i release na serwer Produkcyjny.",
    "location": "L120",
    "timeStart": "20:00",
    "timeEnd": "20:25",
    "speakers": [{"$oid": "507f1f77bcf86cd799439014"}]
  },
  {
    "_id": {"$oid":"507f1f77bcf86cd799439018"},
    "name": "Rozdanie nagród",
    "description": "",
    "location": "L120",
    "timeStart": "20:30",
    "timeEnd": "21:00",
    "speakers": []
  }
]
